{
    "spells": [
        {
            "name": "Gate Seal",
            "level": 4,
            "school": "Abjuration",
            "casting_time": "1 action",
            "ritual": false,
            "range": "60 feet",
            "components": {
              "verbal": true,
              "somatic": true,
              "material": "a broken portal key, which the spell consumes",
              "consumed": true
            },
            "duration": "24 hours",
            "concentration": false,
            "description": "<p>You fortify the fabric of the planes in a 30-foot cube you can see within range. Within that area, portals close and can't be opened for the duration. Spells and other effects that allow planar travel or open portals, such as <i>gate</i> or <i>plane shift</i>, fail if used to enter or leave the area. The cube is stationary.</p>",
            "higher_levels": "When you cast this spell using a spell slot of 6th level or higher, the spell lasts until dispelled.",
            "damage": {
              "type": "utility",
              "amount": null
            },
            "saving_throw": null,
            "source": "Sigil and the Outlands",
            "page_number": 12,
            "spell_list": ["Sorcerer", "Warlock", "Wizard"]
          },
          {
            "name": "Warp Sense",
            "level": 2,
            "school": "Divination",
            "casting_time": "1 action",
            "ritual": false,
            "range": "Self",
            "components": {
              "verbal": true,
              "somatic": true,
              "material": "a razorvine leaf",
              "consumed": false
            },
            "duration": "Concentration, up to 1 minute",
            "concentration": true,
            "description": "<p>For the duration, you sense the presence of portals, even inactive ones, within 30 feet of yourself.</p><p>If you detect a portal in this way, you can use your action to study it. Make a DC 15 ability check using your spellcasting ability. On a successful check, you learn the destination plane of the portal and what portal key it requires, then the spell ends. On a failed check, you learn nothing and can't study that portal again using this spell until you cast it again.</p><p>The spell can penetrate most barriers but is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.</p>",
            "higher_levels": null,
            "damage": {
              "type": "utility",
              "amount": null
            },
            "saving_throw": null,
            "source": "Sigil and the Outlands",
            "page_number": 12,
            "spell_list": ["Sorcerer", "Warlock", "Wizard"]
          }
    ]
}